import random
f = 23800 #本金
i = 1 #玩的次數
g = 10 #賭注
w = 0 #贏的次數
l = 0 #輸的次數
w2 = 0 #大迴圈贏的次數,紀錄玩30次後賺錢的情況
l2 = 0 #大迴圈輸的次數,紀錄玩30次後輸錢的情況
w_m = 0 #紀錄賺錢情況
l_m = 0 #紀錄輸錢的情況
p = 0 #紀錄玩30次後和局的情況
roll = 0 #輸的時候骰了幾次?

#今天你有23800元,玩30次,你會賺還是會賠?
for x in range(1,13): #跑12次,代表每個月都這麼做
    if f != 23800:
        f = 23800
    print(f'-----------------第{x}個月------------------')
    for i in range(1,31): #跑30次,這裡代表每天玩一次
        a = random.randint(1,2) #1代表輸,2代表贏
            
        # print(a)
        
        if a == 1:
            w = w + 1 #紀錄贏的次數  ########這裡有同學可以分享記憶體使用狀況嗎??
            f = f + g #本金+賭注
            # print(f'Win  , 第 <{i}> 次 , 你贏了 "{g}" 元 , 本金 : {f} ')
            i = i + 1 #計數器+1
            g = 10 #賭注reset
            continue #贏了就退出,用break
        
        if a == 2:
            
            roll = roll +1 #紀錄輸的時候骰子連輸的最高次數
            l = l + 1
            f = f - g
            g = g * 2
            # print(f'Lose , 第 <{i}> 次 , 你輸了 "{int(g/2)}" 元 , 本金 : {f} ')
            i = i + 1
            continue
            
    print(f'=====總計玩了{w+l}次,贏了{w}次 , 輸了{l}次 , 本金{f}=====')

    if f > 23800 :
        # print(f'<<<<<YA~爽爽賺囉,不上課了,總計賺了{f-23800}元>>>>>') 
        w2 = w2 + 1
        w_m = w_m + (f-23800)
    elif f < 23800 :
        #print(f'<<<<<輸ㄌQQ,賠了{23800-f}元,還敢賭博r?>>>>>')
        # print(f'<<<<<輸的時候骰了{roll}次>>>>>')
        l2 = l2 + 1
        l_m = l_m + (f-23800)
    else:
        print(f'<<<<<沒賺沒賠,做白工,賠了青春,浪流連QQ>>>>>') ###想內嵌yt撥放,有人有建議套件嗎? pygame  playsound
        p = p + 1 
print(f'12個月下來,每天玩一次,總計賺錢{w2}次,賠錢{l2}次,總計賺錢{w_m}元,賠錢{l_m}元,整體獲益{w_m+l_m},投資報酬率{round((w_m+l_m) / 23800*100,1)}%,每天我可以賺{round((w_m+l_m)/360,2)}元') #原輸出是小數點第17位