import random
f = 23800 #本金 ###資料不實!!109:24000,111基本薪資調漲,應該用爬蟲抓勞動部資料比較準確 https://www.mol.gov.tw/topic/3067/5990/
i = 1 #玩的次數
g = 10 #賭注
w = 0 #贏的次數
l = 0 #輸的次數
t = 7140000 #財富密碼
#我想實現財富自由(月薪*300),需要7140000元,我要玩幾次?

while f < t: #本金沒財富自由就繼續
    a = random.randint(1,2) #1代表輸,2代表贏

    if a == 1:
        w = w + 1
        f = f + g
        # print(f'Win  , 第 <{i}> 次 , 你贏了 "{g}" 元 , 本金 : {f} ')
        i = i + 1
        g = 10
       
                
    if a == 2:
        l = l + 1
        f = f - g
        g = g * 2
        # print(f'Lose , 第 <{i}> 次 , 你輸了 "{int(g/2)}" 元 , 本金 : {f} ')
        i = i + 1
        
        
print(f'=====總計玩了{w+l}次,贏了{w}次 , 輸了{l}次 , 本金{f}=====')